# LegacyShapefileImp

## Description
Use the old UI to import files.

```pascal
PROCEDURE LegacyShapefileImp;
```

```python
def vs.LegacyShapefileImp():
    return None
```

## Version
Availability: from Vectorworks 2012

## Category
* GIS